Tekla.Structures.ModelInternal.dotSpacingZone_t
The spacing zone structure.

Tekla.Structures.ModelInternal.dotSpacingZone_t.Number
The number of spaces.

Tekla.Structures.ModelInternal.dotSpacingZone_t.Spacing
The spacing value.

Tekla.Structures.ModelInternal.dotSpacingZone_t.Length
The zone length.

Tekla.Structures.ModelInternal.dotSpacingZone_t.NumberIsFixed
Indicates whether the number of spaces is fixed.

Tekla.Structures.ModelInternal.dotSpacingZone_t.SpacingIsFixed
Indicates whether the spacing value is fixed.

Tekla.Structures.ModelInternal.dotSpacingZone_t.LengthIsFixed
Indicates whether the zone length is fixed.